# JOIN Statements

### In this notebook we study some use case examples of the JOIN statments. We use Python as our main programming language and make use of libraries such as Pandas ans Psycopg2 to present the results of the queries.

### The JOIN statements helps us to combine rows from multiple tables.

In order to start coding, we have call the pandas and psycopg2 libraries and create a connection to communicate with the database.In order to start coding, we have call the pandas and psycopg2 libraries and create a connection to communicate with the database.

In [15]:
import pandas as pd
import psycopg2 as pg2

connection = pg2.connect(database = 'dvdrental', user = 'postgres', password = 'password')

Just like in the prevous notebook, we´ll define the get_data function in order to prevent memory problems and to make our code more cleanJust like in the prevous notebook, we´ll define the get_data function in order to prevent memory problems and to make our code more clean

In [16]:
def get_data(query, rows = 10):

    with connection.cursor() as cursor:
        cursor. execute(query)

        if rows == 'all':
            raw_data = cursor.fetchall()
        else:
            raw_data = cursor.fetchmany(rows) 

        col_names = [col_desc[0] for col_desc in cursor.description]
        data = pd.DataFrame(raw_data, columns = col_names)

    return data

## INNER JOIN 

The INNER JOIN statement is used to create a new table by combining rows that have matching values in two or more tables. In other words, the INNER JOIN statment helps us to find a sort of intersection between to tables based on their values on a given column, putting together only the rows whose values on that given column appear in both tables.

## Ex. 1

Consider the payment table and the customer table, the customer_id column happens to be in both tables, therefore we can join these two tables on this column. Let's do this and see what result we get

In [17]:
query_1 = '''
          SELECT *  
          FROM payment INNER JOIN customer
          ON payment.customer_id = customer.customer_id
          '''
items_in_customer_and_payment = get_data(query_1)
items_in_customer_and_payment

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
5,17508,341,1,3382,5.99,2007-02-21 12:33:49.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
6,17509,342,2,2190,5.99,2007-02-17 23:58:17.996577,342,1,Harold,Martino,harold.martino@sakilacustomer.org,347,True,2006-02-14,2013-05-26 14:49:45.738,1
7,17510,342,1,2914,5.99,2007-02-20 02:11:44.996577,342,1,Harold,Martino,harold.martino@sakilacustomer.org,347,True,2006-02-14,2013-05-26 14:49:45.738,1
8,17511,342,1,3081,2.99,2007-02-20 13:57:39.996577,342,1,Harold,Martino,harold.martino@sakilacustomer.org,347,True,2006-02-14,2013-05-26 14:49:45.738,1
9,17512,343,2,1547,4.99,2007-02-16 00:10:50.996577,343,1,Douglas,Graf,douglas.graf@sakilacustomer.org,348,True,2006-02-14,2013-05-26 14:49:45.738,1

## Ex. 2

In addition to the above, we can especify which columns to select from either table

In [18]:
query_2 = '''
          SELECT payment_id, payment.customer_id, first_name, last_name 
          FROM payment INNER JOIN customer
          ON payment.customer_id = customer.customer_id
          '''
items_in_customer_and_payment = get_data(query_2)
items_in_customer_and_payment

   payment_id  customer_id first_name last_name
0       17503          341      Peter    Menard
1       17504          341      Peter    Menard
2       17505          341      Peter    Menard
3       17506          341      Peter    Menard
4       17507          341      Peter    Menard
5       17508          341      Peter    Menard
6       17509          342     Harold   Martino
7       17510          342     Harold   Martino
8       17511          342     Harold   Martino
9       17512          343    Douglas      Graf

Notice that, when the tables happen to contain a column with the same name, we use the syntax table.column_name to specify form what tale we want to grab the column named column_name.

## FULL OUTER JOIN Statement

The FULL OUTER JOUN Statement grabs all the rows form both tables, whether their values match or not. When the values in the selected fieds match, the statement will deal with those reow in the excact same way than the INNER JOIN statement. But what happens to the unmatched rows, let's say we want to FULL OUTER JOIN table A with table B, supose that there are umatched rows form table A, in this case, at te moment of incluiding these rows in the output data SQL will fill the missing values, corresponding to table B columns, with NULL values. An analogous procedure occurs in the opposite case. 

## Ex 3.

Let's repeat example 1, but now using the FULL OUTER JOIN statement

In [25]:
query_3 = '''
          SELECT * 
          FROM payment FULL OUTER JOIN customer
          ON payment.customer_id = customer.customer_id
          '''
customer_and_payment = get_data(query_3, rows = 'all')
customer_and_payment

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,17503,341,2,1520,7.99,2007-02-15 22:25:46.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
1,17504,341,1,1778,1.99,2007-02-16 17:23:14.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
2,17505,341,1,1849,7.99,2007-02-16 22:41:45.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
3,17506,341,2,2829,2.99,2007-02-19 19:39:56.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
4,17507,341,2,3130,7.99,2007-02-20 17:31:48.996577,341,1,Peter,Menard,peter.menard@sakilacustomer.org,346,True,2006-02-14,2013-05-26 14:49:45.738,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14591,32094,245,2,12682,2.99,2007-05-14 13:44:29.996577,245,1,Courtney,Day,courtney.day@sakilacustomer.org,249,True,2006-02-14,2013-05-26 14:49:45.738,1
14592,32095,251,1,14107,0.99,2007-05-14 13:44:29.996577,251,2,Vickie,Brewer,vickie.brewer@sakilacustomer.org,255,True,2006-02-14,2013-05-26 14:49:45.738,1
14593,32096,252,2,13756,4.99,2007-05-14 13:44:29.996577,252,2,Mattie,Hoffman,mattie.hoffman@sakilacustomer.org,256,True,2006-02-14,2013-05-26 14:49:45.738,1
14594,32097,263,1,15293,0.99,2007-05-14 13:44:29.996577,263,1,Hilda,Hopkins,hilda.hopkins@sakilacustomer.org,268,True,2006-02-14,2013-05-26 14:49:45.738,1
14595,32098,264,2,14243,2.99,2007-05-14 13:44:29.996577,264,1,Gwendolyn,May,gwendolyn.may@sakilacustomer.org,269,True,2006-02-14,2013-05-26 14:49:45.738,1